Applying **Development**:

```diff
Acquiring state lock. This may take a few moments...
data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Reading...
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=9b798b0ada01ea1e1e5861df12a034f38aa754ec]
module.complete.random_id.this: Refreshing state... [id=2g]
random_id.this: Refreshing state... [id=6A]
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_region.current: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Reading...
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-completee8]
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f]
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_caller_identity.current: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Read complete after 0s [id=3693445097]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_availability_zones.available: Reading...
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0fbf98e2292eee5c6]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl|8D39DB1A-A1CD-4A1C-9D7C-6535BD556666]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 1s [id=us-west-1c]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f|ED2381EE-3FD3-4F9D-B1EA-CA34EF59E1DE]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=1862222295]
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=f908a50202718beb192427899bbddf0729f0d75dc526e77f91aa86739d3914fd]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f|3CD7B4CE-8D3B-4B28-8658-0DF09311BF36]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
data.aws_availability_zone.available["us-west-1b"]: Read complete after 1s [id=us-west-1b]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4236802839]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-da-447552758530]
module.complete.data.aws_ami_ids.sfos: Read complete after 1s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-da]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-077e5d8d215947551]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-067f93f851b1a6006]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-028b335a7d63fa993]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0987d49c80ddee3bb]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0a79b3c06a4743791]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-0e44560ceef6b4622]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-00061adae937156fd]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0a8c96f8271927387]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-028b335a7d63fa9931080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0f1d46884f92085b4]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0cdb7068582c24899]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-05d4f539027f147b0]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-03bdc2967fce3948e]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-077e5d8d2159475511080289494]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-da]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-0535a7ff48d693db4]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-06d4992d966f3bdfd]
module.complete.aws_instance.this: Refreshing state... [id=i-0818e84cc63e2a48a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution_inline_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ec2:AttachNetworkInterface",
+               "ec2:CreateNetworkInterface",
+               "ec2:DeleteNetworkInterface",
+               "ec2:DescribeInstances",
+               "ec2:DescribeNetworkInterfaces",
            ]
+           resources = [
+               "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0f1d46884f92085b4",
            ]
        }
    }

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-0535a7ff48d693db4"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-da"
        name        = "ec2-instance-profile-SOPHOS_CNF-da"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
        id                    = "LambdaExecutionRole-SOPHOS_CNF-da"
        name                  = "LambdaExecutionRole-SOPHOS_CNF-da"
      ~ tags                  = {} -> (known after apply)
        # (9 unchanged attributes hidden)

+       inline_policy {
+           name   = "lambda-config-policy-SOPHOS_CNF-da"
+           policy = (known after apply)
        }
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-da-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-da-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0818e84cc63e2a48a"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "22e36724f41542bb486517b9c9ca0b2356b438d6" -> "3bd356c49c0f306404bb4f0e14a9fc2251e4319d"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-067f93f851b1a6006"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "../../initial_config.zip"
+       function_name                  = "XG-Initial-Config-SOPHOS_CNF-da"
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-da"
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f"
+               "IP"                  = "10.0.1.136"
+               "PASSWORD"            = "admin"
+               "REGION_NAME"         = "us-west-1"
+               "USERNAME"            = "admin"
            }
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = [
+               "sg-00061adae937156fd",
            ]
+           subnet_ids         = [
+               "subnet-0987d49c80ddee3bb",
            ]
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-06d4992d966f3bdfd"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-da-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-0f1d46884f92085b4"
      ~ tags                      = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-05d4f539027f147b0"
      ~ tags                      = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-077e5d8d215947551"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-028b335a7d63fa993"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-00061adae937156fd"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-0a79b3c06a4743791"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0a8c96f8271927387"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "20.12.54.47/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "20.165.57.47/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0e44560ceef6b4622"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0fbf98e2292eee5c6"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-da-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-29-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

```
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=9b798b0ada01ea1e1e5861df12a034f38aa754ec]
module.complete.data.http.my_public_ip: Reading...
module.complete.random_id.this: Refreshing state... [id=2g]
data.http.my_public_ip: Reading...
random_id.this: Refreshing state... [id=6A]
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_region.current: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Reading...
module.complete.data.aws_caller_identity.current: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f]
data.aws_availability_zones.available: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Read complete after 0s [id=3693445097]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl]
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-completee8]
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0fbf98e2292eee5c6]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f|ED2381EE-3FD3-4F9D-B1EA-CA34EF59E1DE]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=1862222295]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f|3CD7B4CE-8D3B-4B28-8658-0DF09311BF36]
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=f908a50202718beb192427899bbddf0729f0d75dc526e77f91aa86739d3914fd]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl|8D39DB1A-A1CD-4A1C-9D7C-6535BD556666]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=4236802839]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-da-447552758530]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 1s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 1s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 1s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 1s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 1s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 1s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 1s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 1s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-da]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-067f93f851b1a6006]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-028b335a7d63fa993]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-00061adae937156fd]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-0e44560ceef6b4622]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0a8c96f8271927387]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-077e5d8d215947551]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-0987d49c80ddee3bb]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0a79b3c06a4743791]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-028b335a7d63fa9931080289494]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0cdb7068582c24899]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-05d4f539027f147b0]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0f1d46884f92085b4]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-03bdc2967fce3948e]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-0535a7ff48d693db4]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-077e5d8d2159475511080289494]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-da]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-06d4992d966f3bdfd]
module.complete.aws_instance.this: Refreshing state... [id=i-0818e84cc63e2a48a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "example-complete6A==" -> null
      - b64_url     = "example-complete6A" -> null
      - byte_length = 1 -> null
      - dec         = "example-complete232" -> null
      - hex         = "example-completee8" -> null
      - id          = "6A" -> null
      - prefix      = "example-complete" -> null
    }

  # module.complete.aws_eip.this[0] will be destroyed
  - resource "aws_eip" "this" {
      - allocation_id             = "eipalloc-0535a7ff48d693db4" -> null
      - associate_with_private_ip = "10.0.0.158" -> null
      - association_id            = "eipassoc-085847aa15299ecf4" -> null
      - domain                    = "vpc" -> null
      - id                        = "eipalloc-0535a7ff48d693db4" -> null
      - instance                  = "i-0818e84cc63e2a48a" -> null
      - network_border_group      = "us-west-1" -> null
      - network_interface         = "eni-05d4f539027f147b0" -> null
      - private_dns               = "ip-10-0-0-158.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.158" -> null
      - public_dns                = "ec2-50-18-130-148.us-west-1.compute.amazonaws.com" -> null
      - public_ip                 = "50.18.130.148" -> null
      - public_ipv4_pool          = "amazon" -> null
      - tags                      = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc                       = true -> null
    }

  # module.complete.aws_iam_instance_profile.this will be destroyed
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::447552758530:instance-profile/ec2-instance-profile-SOPHOS_CNF-da" -> null
      - create_date = "2022-09-29T01:53:44Z" -> null
      - id          = "ec2-instance-profile-SOPHOS_CNF-da" -> null
      - name        = "ec2-instance-profile-SOPHOS_CNF-da" -> null
      - path        = "/" -> null
      - role        = "ec2-iam-role-SOPHOS_CNF-da-447552758530" -> null
      - tags        = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id   = "AIPAWQNBZEMBGOYC4FELJ" -> null
    }

  # module.complete.aws_iam_role.lambda_execution_role will be destroyed
  - resource "aws_iam_role" "lambda_execution_role" {
      - arn                   = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-da" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-29T01:53:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "LambdaExecutionRole-SOPHOS_CNF-da" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "LambdaExecutionRole-SOPHOS_CNF-da" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWQNBZEMBKDK6REL46" -> null
    }

  # module.complete.aws_iam_role.this will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::447552758530:role/ec2-iam-role-SOPHOS_CNF-da-447552758530" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-29T01:53:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2-iam-role-SOPHOS_CNF-da-447552758530" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2-iam-role-SOPHOS_CNF-da-447552758530" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all              = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id             = "AROAWQNBZEMBN5H5WU4T3" -> null

      - inline_policy {
          - name   = "ec2-policy-SOPHOS_CNF-da" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f",
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl",
                            ]
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ssm-policy-SOPHOS_CNF-da" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_instance.this will be destroyed
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0f37b9b5182756d01" -> null
      - arn                                  = "arn:aws:ec2:us-west-1:447552758530:instance/i-0818e84cc63e2a48a" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-west-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2-instance-profile-SOPHOS_CNF-da" -> null
      - id                                   = "i-0818e84cc63e2a48a" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "sophos-example-completee8" -> null
      - monitoring                           = true -> null
      - primary_network_interface_id         = "eni-0f1d46884f92085b4" -> null
      - private_dns                          = "ip-10-0-1-136.us-west-1.compute.internal" -> null
      - private_ip                           = "10.0.1.136" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = false -> null
      - subnet_id                            = "subnet-0987d49c80ddee3bb" -> null
      - tags                                 = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                             = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "22e36724f41542bb486517b9c9ca0b2356b438d6" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-00061adae937156fd",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvdg" -> null
          - encrypted             = false -> null
          - iops                  = 240 -> null
          - snapshot_id           = "snap-0ac9373189f97066a" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0f48c4b1b69642823" -> null
          - volume_size           = 80 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - launch_template {
          - id      = "lt-06d4992d966f3bdfd" -> null
          - name    = "launch-template-SOPHOS_CNF-da-447552758530" -> null
          - version = "$Latest" -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-072301fe6cde49da7" -> null
          - volume_size           = 16 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be destroyed
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-1:447552758530:internet-gateway/igw-067f93f851b1a6006" -> null
      - id       = "igw-067f93f851b1a6006" -> null
      - owner_id = "447552758530" -> null
      - tags     = {
          - "Name"          = "igw-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all = {
          - "Name"          = "igw-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id   = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_launch_template.this will be destroyed
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:us-west-1:447552758530:launch-template/lt-06d4992d966f3bdfd" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-06d4992d966f3bdfd" -> null
      - image_id                = "ami-0f37b9b5182756d01" -> null
      - instance_type           = "t3.medium" -> null
      - key_name                = "sophos-example-completee8" -> null
      - latest_version          = 1 -> null
      - name                    = "launch-template-SOPHOS_CNF-da-447552758530" -> null
      - security_group_names    = [] -> null
      - tags                    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - user_data               = "eyJzc21rU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1zZWN1cmUtc3RvcmFnZS1tYXN0ZXIta2V5LVNPUEhPU19DTkYtZGEtT01KaTFmIiwiaG9zdG5hbWUiOiJzb3Bob3MteGctdGVycmFmb3JtIiwic2VuZHN0YXRzIjogIm9uIiwicmVnaW9uIjoidXMtd2VzdC0xIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1jb25zb2xlLXBhc3N3b3JkLVNPUEhPU19DTkYtZGEtT01KaTFmIiwiY29uZmlnU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1iYWNrdXAtY29uZmlndXJhdGlvbi1wYXNzd29yZC1TT1BIT1NfQ05GLWRhLU0xbTdkbCJ9" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 16 -> null
              - volume_type           = "gp2" -> null
            }
        }
      - block_device_mappings {
          - device_name = "/dev/xvdg" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 80 -> null
              - volume_type           = "gp2" -> null
            }
        }

      - iam_instance_profile {
          - name = "ec2-iam-role-SOPHOS_CNF-da-447552758530" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - network_interfaces {
          - device_index         = 1 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-05d4f539027f147b0" -> null
          - security_groups      = [] -> null
        }
      - network_interfaces {
          - device_index         = 0 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-0f1d46884f92085b4" -> null
          - security_groups      = [] -> null
        }
    }

  # module.complete.aws_network_interface.private will be destroyed
  - resource "aws_network_interface" "private" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0f1d46884f92085b4" -> null
      - description               = "ENI for Private Subnet" -> null
      - id                        = "eni-0f1d46884f92085b4" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:62:ee:e6:9e:6f" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-1-136.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.1.136" -> null
      - private_ip_list           = [
          - "10.0.1.136",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.1.136",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-00061adae937156fd",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-0987d49c80ddee3bb" -> null
      - tags                      = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-0d04a65196cc36929" -> null
          - device_index  = 0 -> null
          - instance      = "i-0818e84cc63e2a48a" -> null
        }
    }

  # module.complete.aws_network_interface.public will be destroyed
  - resource "aws_network_interface" "public" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-05d4f539027f147b0" -> null
      - description               = "ENI for Public Subnet" -> null
      - id                        = "eni-05d4f539027f147b0" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:9d:f2:87:6f:eb" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-0-158.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.158" -> null
      - private_ip_list           = [
          - "10.0.0.158",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.0.158",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-0a79b3c06a4743791",
          - "sg-0a8c96f8271927387",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-0e44560ceef6b4622" -> null
      - tags                      = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-092bfc7334fb6fd1a" -> null
          - device_index  = 1 -> null
          - instance      = "i-0818e84cc63e2a48a" -> null
        }
    }

  # module.complete.aws_route.private will be destroyed
  - resource "aws_route" "private" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-077e5d8d2159475511080289494" -> null
      - instance_id            = "i-0818e84cc63e2a48a" -> null
      - instance_owner_id      = "447552758530" -> null
      - network_interface_id   = "eni-0f1d46884f92085b4" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-077e5d8d215947551" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route.public will be destroyed
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-067f93f851b1a6006" -> null
      - id                     = "r-rtb-028b335a7d63fa9931080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-028b335a7d63fa993" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route_table.private[0] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-077e5d8d215947551" -> null
      - id               = "rtb-077e5d8d215947551" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = "i-0818e84cc63e2a48a"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = "eni-0f1d46884f92085b4"
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_route_table.public[0] will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-028b335a7d63fa993" -> null
      - id               = "rtb-028b335a7d63fa993" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-067f93f851b1a6006"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_route_table_association.private will be destroyed
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-03bdc2967fce3948e" -> null
      - route_table_id = "rtb-077e5d8d215947551" -> null
      - subnet_id      = "subnet-0987d49c80ddee3bb" -> null
    }

  # module.complete.aws_route_table_association.public will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0cdb7068582c24899" -> null
      - route_table_id = "rtb-028b335a7d63fa993" -> null
      - subnet_id      = "subnet-0e44560ceef6b4622" -> null
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret" "config_backup_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl" -> null
      - name                           = "sophos-fw-backup-configuration-password-SOPHOS_CNF-da" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.console_password will be destroyed
  - resource "aws_secretsmanager_secret" "console_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f" -> null
      - name                           = "sophos-fw-console-password-SOPHOS_CNF-da" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret" "secure_storage_master_key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f" -> null
      - name                           = "sophos-fw-secure-storage-master-key-SOPHOS_CNF-da" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "config_backup_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl|8D39DB1A-A1CD-4A1C-9D7C-6535BD556666" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl" -> null
      - secret_string  = (sensitive value)
      - version_id     = "8D39DB1A-A1CD-4A1C-9D7C-6535BD556666" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "console_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f|3CD7B4CE-8D3B-4B28-8658-0DF09311BF36" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f" -> null
      - secret_string  = (sensitive value)
      - version_id     = "3CD7B4CE-8D3B-4B28-8658-0DF09311BF36" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f|ED2381EE-3FD3-4F9D-B1EA-CA34EF59E1DE" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f" -> null
      - secret_string  = (sensitive value)
      - version_id     = "ED2381EE-3FD3-4F9D-B1EA-CA34EF59E1DE" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_security_group.lan[0] will be destroyed
  - resource "aws_security_group" "lan" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-00061adae937156fd" -> null
      - description            = "Security Group for private subnet. Allow everything by default" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-00061adae937156fd" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Private Subnet" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_security_group.public[0] will be destroyed
  - resource "aws_security_group" "public" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0a79b3c06a4743791" -> null
      - description            = "Untrusted network restricted from access port 22 and 4444" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a79b3c06a4743791" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 0 - 21"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 21
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 23 - 4443"
              - from_port        = 23
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 4445 - 65535"
              - from_port        = 4445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Public" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_security_group.trusted[0] will be destroyed
  - resource "aws_security_group" "trusted" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0a8c96f8271927387" -> null
      - description            = "Enable TCP access from trusted network" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a8c96f8271927387" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "47.184.79.94/32",
                  - "20.165.57.47/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Trusted Network" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_subnet.private[0] will be destroyed
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-0987d49c80ddee3bb" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0987d49c80ddee3bb" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-SOPHOS_CNF-da-447552758530"
        } -> null
      - tags_all                                       = {
          - "Name" = "private-SOPHOS_CNF-da-447552758530"
        } -> null
      - vpc_id                                         = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_subnet.public[0] will be destroyed
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-0e44560ceef6b4622" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e44560ceef6b4622" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"          = "public-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                                       = {
          - "Name"          = "public-SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                                         = "vpc-0fbf98e2292eee5c6" -> null
    }

  # module.complete.aws_vpc.this[0] will be destroyed
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-west-1:447552758530:vpc/vpc-0fbf98e2292eee5c6" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-04ce4e27bdc82f577" -> null
      - default_route_table_id           = "rtb-06bcd7781f2a5babe" -> null
      - default_security_group_id        = "sg-0b97df2864fe9a270" -> null
      - dhcp_options_id                  = "dopt-001808c76c9383c0b" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0fbf98e2292eee5c6" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-06bcd7781f2a5babe" -> null
      - owner_id                         = "447552758530" -> null
      - tags                             = {
          - "Name"          = "SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                         = {
          - "Name"          = "SOPHOS_CNF-da-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-29-2022"
          - "managed_by"    = "Terraform"
        } -> null
    }

  # module.complete.random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "SOPHOS_CNF-2g==" -> null
      - b64_url     = "SOPHOS_CNF-2g" -> null
      - byte_length = 1 -> null
      - dec         = "SOPHOS_CNF-218" -> null
      - hex         = "SOPHOS_CNF-da" -> null
      - id          = "2g" -> null
      - prefix      = "SOPHOS_CNF-" -> null
    }

  # module.key-pair.aws_key_pair.this[0] will be destroyed
  - resource "aws_key_pair" "this" {
      - arn         = "arn:aws:ec2:us-west-1:447552758530:key-pair/sophos-example-completee8" -> null
      - fingerprint = "2c:b6:e1:b3:cb:36:80:de:ba:98:b4:4a:13:ec:94:4e" -> null
      - id          = "sophos-example-completee8" -> null
      - key_name    = "sophos-example-completee8" -> null
      - key_pair_id = "key-0a66514451a3d31a6" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCoU/A97kGyaHoZ4w4eurQcl8KgUo0Ubfx0q0ry4Llm3jLCb7vAtFvrWvEfzLW3lDp7PTCrew5Yn0/2T/qfAijwNS3lGSa9l5/5E496mrJWtgjioFAATR+nWJwv+g0Xt9DJ/0u4O7pv2pn+ZtOBHS7aJoRW1ho5NnxikRiMALwRTJdQ7yWTpEJJ6oq25QoZmRsehwnZ9dAIwvYg6YMZ3Gj4O250LsejNa8XFcKt1UBkksUQw2fZ0XLouYVOETs3vhXn4mwRw2MqFm/HTeT+160jNLWqu9KuCPi4OcUDrSDjVLW9EaK+bA1SmDR89fQMFaqscpnI6pXwaIUDKiovN5NaLwpRg3osrdjeCfMPuhMdPvb4yCjIPpZnNyFxGwxJac4LiSd3OuvUzFS6rrPKqJXOhm3ugNKEViypI4AMx6lEShjiEf2OpEaoolotq0D+S+SgkfVvO+vSYx4zUOYRlvzVhI+eykE54ZcSx5bbe/00RanUtDIEyx7qQ/rag7uICJOoLNMREG7UOm44kQE/uK+9x8DqsebiAUvkv8bY1+7kr1cS/HqWMfpDWuk0RjwgIwscbkz6tY0tn5+xsIs9qe/EwNfZ3jRpLi6qWX+Oh+zkVx5EVMU5Ti35lTEF05Ha8obMizTC9+WAIoMoJkhlI2cAEtK4fwVWseWKBsZVtMcJTQ==" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.key-pair.tls_private_key.this[0] will be destroyed
  - resource "tls_private_key" "this" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "9b798b0ada01ea1e1e5861df12a034f38aa754ec" -> null
      - private_key_openssh           = (sensitive value)
      - private_key_pem               = (sensitive value)
      - private_key_pem_pkcs8         = (sensitive value)
      - public_key_fingerprint_md5    = "8c:0b:7e:12:e3:06:a1:07:5d:4f:7e:6d:40:77:80:c7" -> null
      - public_key_fingerprint_sha256 = "SHA256:ZPNb6QKQ1F/qePksPc2q30ptFJbiWknOTHGxjtKQvAo" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCoU/A97kGyaHoZ4w4eurQcl8KgUo0Ubfx0q0ry4Llm3jLCb7vAtFvrWvEfzLW3lDp7PTCrew5Yn0/2T/qfAijwNS3lGSa9l5/5E496mrJWtgjioFAATR+nWJwv+g0Xt9DJ/0u4O7pv2pn+ZtOBHS7aJoRW1ho5NnxikRiMALwRTJdQ7yWTpEJJ6oq25QoZmRsehwnZ9dAIwvYg6YMZ3Gj4O250LsejNa8XFcKt1UBkksUQw2fZ0XLouYVOETs3vhXn4mwRw2MqFm/HTeT+160jNLWqu9KuCPi4OcUDrSDjVLW9EaK+bA1SmDR89fQMFaqscpnI6pXwaIUDKiovN5NaLwpRg3osrdjeCfMPuhMdPvb4yCjIPpZnNyFxGwxJac4LiSd3OuvUzFS6rrPKqJXOhm3ugNKEViypI4AMx6lEShjiEf2OpEaoolotq0D+S+SgkfVvO+vSYx4zUOYRlvzVhI+eykE54ZcSx5bbe/00RanUtDIEyx7qQ/rag7uICJOoLNMREG7UOm44kQE/uK+9x8DqsebiAUvkv8bY1+7kr1cS/HqWMfpDWuk0RjwgIwscbkz6tY0tn5+xsIs9qe/EwNfZ3jRpLi6qWX+Oh+zkVx5EVMU5Ti35lTEF05Ha8obMizTC9+WAIoMoJkhlI2cAEtK4fwVWseWKBsZVtMcJTQ==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEAqFPwPe5Bsmh6GeMOHrq0
            HJfCoFKNFG38dKtK8uC5Zt4ywm+7wLRb61rxH8y1t5Q6ez0wq3sOWJ9P9k/6nwIo
            8DUt5RkmvZef+ROPepqyVrYI4qBQAE0fp1icL/oNF7fQyf9LuDu6b9qZ/mbTgR0u
            2iaEVtYaOTZ8YpEYjAC8EUyXUO8lk6RCSeqKtuUKGZkbHocJ2fXQCML2IOmDGdxo
            +DtudC7HozWvFxXCrdVAZJLFEMNn2dFy6LmFThE7N74V5+JsEcNjKhZvx03k/tet
            IzS1qrvSrgj4uDnFA60g41S1vRGivmwNUpg0fPX0DBWqrHKZyOqV8GiFAyoqLzeT
            Wi8KUYN6LK3Y3gnzD7oTHT72+MgoyD6WZzchcRsMSWnOC4kndzrr1MxUuq6zyqiV
            zoZt7oDShFYsqSOADMepREoY4hH9jqRGqKJaLatA/kvkoJH1bzvr0mMeM1DmEZb8
            1YSPnspBOeGXEseW23v9NEWp1LQyBMse6kP62oO7iAiTqCzTERBu1DpuOJEBP7iv
            vcfA6rHm4gFL5L/G2Nfu5K9XEvx6ljH6Q1rpNEY8ICMLHG5M+rWNLZ+fsbCLPanv
            xMDX2d40aS4uqll/jofs5FceRFTFOU4t+ZUxBdOR2vKGzIs0wvflgCKDKCZIZSNn
            ABLSuH8FVrHligbGVbTHCU0CAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 0 to add, 0 to change, 31 to destroy.

Changes to Outputs:
  - archive_name          = "7517866eb05f876f45c1f92f4725f6c55a51fdd7" -> null
  - availability_zone_map = {
      - us-west-1b = "usw1-az3"
      - us-west-1c = "usw1-az1"
    } -> null
  - private_key           = (sensitive value)
module.complete.aws_route.public: Destroying... [id=r-rtb-028b335a7d63fa9931080289494]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f|ED2381EE-3FD3-4F9D-B1EA-CA34EF59E1DE]
module.complete.aws_route.private: Destroying... [id=r-rtb-077e5d8d2159475511080289494]
module.complete.aws_route_table_association.private: Destroying... [id=rtbassoc-03bdc2967fce3948e]
module.complete.aws_instance.this: Destroying... [id=i-0818e84cc63e2a48a]
module.complete.aws_route_table_association.public: Destroying... [id=rtbassoc-0cdb7068582c24899]
module.complete.aws_eip.this[0]: Destroying... [id=eipalloc-0535a7ff48d693db4]
module.complete.aws_iam_role.lambda_execution_role: Destroying... [id=LambdaExecutionRole-SOPHOS_CNF-da]
module.complete.aws_secretsmanager_secret_version.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f|3CD7B4CE-8D3B-4B28-8658-0DF09311BF36]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl|8D39DB1A-A1CD-4A1C-9D7C-6535BD556666]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.console_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_iam_role.lambda_execution_role: Destruction complete after 1s
module.complete.aws_route_table_association.private: Destruction complete after 1s
module.complete.aws_route_table_association.public: Destruction complete after 1s
module.complete.aws_route.public: Destruction complete after 1s
module.complete.aws_internet_gateway.this[0]: Destroying... [id=igw-067f93f851b1a6006]
module.complete.aws_route_table.public[0]: Destroying... [id=rtb-028b335a7d63fa993]
module.complete.aws_route.private: Destruction complete after 1s
module.complete.aws_route_table.private[0]: Destroying... [id=rtb-077e5d8d215947551]
module.complete.aws_route_table.public[0]: Destruction complete after 1s
module.complete.aws_route_table.private[0]: Destruction complete after 1s
module.complete.aws_eip.this[0]: Destruction complete after 2s
module.complete.aws_internet_gateway.this[0]: Destruction complete after 2s
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 1m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 1m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 1m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 1m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 1m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 1m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 2m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 2m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 2m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 2m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 2m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 2m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 3m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 3m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 3m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 3m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 3m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 3m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 4m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 4m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 4m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 4m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0818e84cc63e2a48a, 4m40s elapsed]
module.complete.aws_instance.this: Destruction complete after 4m44s
module.complete.aws_iam_instance_profile.this: Destroying... [id=ec2-instance-profile-SOPHOS_CNF-da]
module.complete.aws_launch_template.this: Destroying... [id=lt-06d4992d966f3bdfd]
module.complete.aws_iam_instance_profile.this: Destruction complete after 0s
module.complete.aws_launch_template.this: Destruction complete after 0s
module.complete.aws_network_interface.private: Destroying... [id=eni-0f1d46884f92085b4]
module.complete.aws_iam_role.this: Destroying... [id=ec2-iam-role-SOPHOS_CNF-da-447552758530]
module.key-pair.aws_key_pair.this[0]: Destroying... [id=sophos-example-completee8]
module.complete.aws_network_interface.public: Destroying... [id=eni-05d4f539027f147b0]
module.key-pair.aws_key_pair.this[0]: Destruction complete after 1s
random_id.this: Destroying... [id=6A]
module.key-pair.tls_private_key.this[0]: Destroying... [id=9b798b0ada01ea1e1e5861df12a034f38aa754ec]
random_id.this: Destruction complete after 0s
module.key-pair.tls_private_key.this[0]: Destruction complete after 0s
module.complete.aws_iam_role.this: Destruction complete after 1s
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-da-OMJi1f]
module.complete.aws_secretsmanager_secret.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-da-M1m7dl]
module.complete.aws_secretsmanager_secret.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-da-OMJi1f]
module.complete.aws_secretsmanager_secret.config_backup_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.console_password: Destruction complete after 0s
module.complete.aws_network_interface.private: Destruction complete after 1s
module.complete.aws_subnet.private[0]: Destroying... [id=subnet-0987d49c80ddee3bb]
module.complete.aws_security_group.lan[0]: Destroying... [id=sg-00061adae937156fd]
module.complete.aws_network_interface.public: Destruction complete after 1s
module.complete.aws_subnet.public[0]: Destroying... [id=subnet-0e44560ceef6b4622]
module.complete.aws_security_group.trusted[0]: Destroying... [id=sg-0a8c96f8271927387]
module.complete.aws_security_group.public[0]: Destroying... [id=sg-0a79b3c06a4743791]
module.complete.aws_subnet.private[0]: Destruction complete after 1s
module.complete.aws_subnet.public[0]: Destruction complete after 1s
module.complete.aws_security_group.lan[0]: Destruction complete after 1s
module.complete.aws_security_group.trusted[0]: Destruction complete after 1s
module.complete.aws_security_group.public[0]: Destruction complete after 1s
module.complete.aws_vpc.this[0]: Destroying... [id=vpc-0fbf98e2292eee5c6]
module.complete.aws_vpc.this[0]: Destruction complete after 1s
module.complete.random_id.this: Destroying... [id=2g]
module.complete.random_id.this: Destruction complete after 0s

Destroy complete! Resources: 31 destroyed.

```